const drinks = [
    "旺仔", "冰红茶", "冰绿茶", "雪碧", "可乐", "芬达", "美年达", "脉动", "尖叫", "元气森林", "怡宝", "七喜", "酸梅汤", "ad钙奶", "芝士葡萄", "蜜雪冰城", "古茗", "沪上阿姨", "冰糖雪梨", "酷儿", "可口",
    "哇哈哈", "农夫山泉", "百岁山", "柠檬茶", "喜茶", "茉莉花茶", "红牛", "战马", "杨枝甘露", "冰露", "一点点", "茶百道", "益禾堂", "CoCo", "奈雪", "东鹏", "爽歪歪", "燕京", "优酸乳", "百事", "星巴克",
    "椰汁", "王老吉", "加多宝", "东方树叶", "茶π", "苏打水", "RIO", "雀巢", "李子园", "果粒橙", "乌龙茶", "格瓦斯", "双柚汁", "拿铁", "冰美式", "酸奶", "雪花", "真果粒", "瑞幸", "霸王茶姬"
    ];

const heroes = [
    "小乔","曜","廉颇","白起","项羽","东皇太一","猪八戒","苏烈","刘邦","钟无艳","程咬金","张飞","牛魔","夏侯惇","吕布","庄周","墨子","达摩","芈月","孙策",
    "亚瑟","曹操","宫本武藏","李信","关羽","杨戬","韩信","哪吒","狂铁","老夫子","李白","刘备","孙悟空","马超","黄忠","李元芳","司空震","蔡文姬","嫦娥",
    "上官婉儿","赵云","裴擒虎","蒙恬","梦奇","铠","阿轲","橘右京","娜可露露","不知火舞","元歌","司马懿","云中君","澜","百里玄策","百里守约","鲁班大师",
    "镜","兰陵王","花木兰","妲己","安琪拉","王昭君","甄姬","貂蝉","周瑜","姜子牙","诸葛亮","武则天","张良","干将莫邪","钟馗","孙膑","盾山","金蝉",
    "扁鹊","高渐离","嬴政","沈梦溪","弈星","米莱狄","女娲","明世隐","艾琳","云缨","金蝉","后羿","狄仁杰","苍","马可波罗","孙尚香","虞姬","刘禅",
    "公孙离","伽罗","蒙犽","大乔","太乙真人","鬼谷子","瑶","孙权","少思缘","影","元坦","元法","大司命","敖隐","海诺","朵莉亚","亚连","姬小满",
    "赵怀真","戈娅","桑启","暃","海月","莱西奥","元射","露娜","鲁班七号","西施","阿古朵","夏洛特","盘古","空空儿"
    ];

function generateName() {
    const drink = drinks[Math.floor(Math.random() * drinks.length)];
    const hero = heroes[Math.floor(Math.random() * heroes.length)];
    document.getElementById("result").textContent = drink + hero;
}
